{
  "plan_id": "1",
  "food": {
    "breakfast": [
      {
        "name": "Overnight oats",
        "description": "Oats soaked in almond milk with chia seeds, sliced strawberries, and a sprinkle of cinnamon",
        "contents": {
          "calories": 250,
          "carbohydrates": 35,
          "protein": 10,
          "fiber": 4,
          "fat": 6,
          "vitamins": ["Vitamin B", "Vitamin C", "Vitamin E"],
          "minerals": ["Iron", "Phosphorus", "Magnesium"]
        }
      },
      {
        "name": "Egg white omelette",
        "description": "Omelette made with egg whites, spinach, bell peppers, and avocado",
        "contents": {
          "calories": 200,
          "protein": 12,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E", "Vitamin B12"],
          "minerals": ["Iron", "Calcium", "Magnesium", "Zinc"]
        }
      },
      {
        "name": "Smoothie bowl",
        "description": "Smoothie made with unsweetened almond milk, frozen berries, spinach, and protein powder topped with granola and sliced almonds",
        "contents": {
          "calories": 300,
          "protein": 20,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Greek yogurt parfait",
        "description": "Greek yogurt layered with mixed berries and a sprinkle of honey",
        "contents": {
          "calories": 200,
          "protein": 15,
          "vitamins": ["Vitamin A", "Vitamin C"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Avocado toast",
        "description": "Whole grain toast topped with mashed avocado, cherry tomatoes, and a sprinkle of salt",
        "contents": {
          "calories": 250,
          "protein": 6,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Peanut butter banana toast",
        "description": "Whole grain toast topped with peanut butter and sliced bananas",
        "contents": {
          "calories": 300,
          "protein": 8,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Scrambled eggs with veggies",
        "description": "Scrambled eggs with diced bell peppers, onions, and mushrooms",
        "contents": {
          "calories": 200,
          "protein": 12,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E", "Vitamin B12"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {"name": "Quinoa and almond milk breakfast bowl",
      "description": "A bowl of quinoa mixed with almond milk and topped with sliced bananas and a sprinkle of cinnamon. Quinoa is a good source of protein and contains a variety of nutrients such as manganese, iron, copper, phosphorus, magnesium, zinc, vitamin B2, and dietary fiber. Almond milk is a plant-based milk made from ground almonds and water, and it is rich in protein, vitamins, and minerals. It is also low in calories and contains no lactose or gluten.",
      "contents": {
        "calories": 250,
        "protein": 10,
        "vitamins": ["A", "B1", "B2", "B3", "E"],
        "minerals": ["magnésium", "calcium", "zinc", "fer", "cuivre", "manganèse"]
      }
      },
      {
        "name": "Cottage cheese with fruit",
        "description": "Cottage cheese topped with mixed berries and a sprinkle of honey",
        "contents": {
          "calories": 250,
          "protein": 15,
          "vitamins": ["Vitamin D", "Vitamin B12"],
          "minerals": ["Calcium", "Phosphorus"]
        }
      }
    ],
    "launch": [
      {
        "name": "Mediterranean Quinoa Salad",
        "description": "A healthy and flavorful salad made with quinoa, cherry tomatoes, cucumber, red onion, Kalamata olives, and feta cheese, all tossed in a homemade lemon vinaigrette. Perfect for a light lunch or as a side dish for a BBQ.",
        "contents": {
          "calories": 250,
          "protein": 8,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Grilled Chicken with Roasted Vegetables",
        "description": "Grilled chicken breast served with a side of roasted vegetables, including broccoli, bell peppers, and zucchini. This meal is high in protein and low in calories, making it a great option for those looking to lose weight.",
        "contents": {
          "calories": 300,
          "protein": 25,
          "vitamins": ["Vitamin A", "Vitamin C"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Baked Salmon with Roasted Asparagus and Quinoa",
        "description": "Baked salmon served with roasted asparagus and a side of quinoa. This meal is high in protein and packed with nutrients, making it a great choice for those looking to lose weight. The quinoa adds a healthy dose of complex carbohydrates, while the asparagus provides a source of fiber.",
        "contents": {
          "calories": 400,
          "protein": 30,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin D", "Vitamin E"],
          "minerals": ["Iron", "Calcium", "Potassium"]
        }
      },      
      {
        "name": "Veggie Omelette with Whole Wheat Toast",
        "description": "A veggie omelette made with eggs, spinach, bell peppers, and onions, served with a slice of whole wheat toast. This meal is high in protein and provides a good source of fiber, making it a great choice for those looking to lose weight. The whole wheat toast adds a healthy dose of complex carbohydrates.",
        "contents": {
          "calories": 250,
          "protein": 15,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E", "Vitamin B12"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Turkey and Avocado Wrap",
        "description": "A wrap made with sliced turkey, avocado, lettuce, and tomato, all rolled up in a whole wheat tortilla. This meal is high in protein and provides a good source of fiber, making it a great choice for those looking to lose weight. The avocado adds healthy fats, while the whole wheat tortilla provides complex carbohydrates.",
        "contents": {
          "calories": 350,
          "protein": 20,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin E"],
          "minerals": ["Iron", "Calcium"]
        }
      },
      {
        "name": "Quinoa and black bean salad",
        "description": "Salad made with quinoa, black beans, cherry tomatoes, cucumber, and avocado, dressed with olive oil and lemon juice",
        "contents": {
          "calories": 400,
          "protein": 20,
          "vitamins": ["Vitamin C", "Vitamin B6"],
          "minerals": ["Iron", "Magnesium", "Phosphorous"]
        }
      }  
    ],
    "dinner": [
      {
        "name": "Grilled salmon with roasted vegetables",
        "description": "Grilled salmon served with a side of roasted vegetables, including zucchini, bell peppers, and cherry tomatoes, and a squeeze of lemon juice",
        "contents": {
          "calories": 300,
          "protein": 24,
          "fats": 4,
          "vitamins": ["Vitamin A", "Vitamin C", "Vitamin D"],
          "minerals": ["Iron", "Calcium", "Omega-3 fatty acids"]
        }
      }
    ]
  },
  "days": [
    {
      "day": "Monday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Tuesday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Wednesday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Thursday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Friday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Saturday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Sunday",
      "meals": [
        {
          "name": "Breakfast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "start_time": "09:05",
          "end_time": "09:35"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    }
  ],
  "advice": [
    "Start each meal with a small serving of vegetables to fill up on low-calorie, nutrient-dense foods.",
    "Choose protein sources that are lean and low in saturated fat, such as chicken, fish, and beans.",
    "Incorporate strength training into your fitness routine to build lean muscle and boost your metabolism.",
    "Drink plenty of water throughout the day to stay hydrated and prevent overeating.",
    "Get enough sleep each night to support healthy weight loss and overall well-being.",
    "Choose whole grains over refined grains for added nutrients and fiber.",
    "Limit your intake of sugary drinks and snacks to reduce your overall calorie intake.",
    "Plan your meals and snacks in advance to stay on track and avoid impulsive eating.",
    "Choose healthier cooking methods, such as grilling, baking, or roasting, instead of deep frying.",
    "Get support from friends, family, or a healthcare professional to help you stay motivated and on track.",
    "Stay hydrated by drinking at least 8 glasses of water per day",
    "Get plenty of sleep to aid in weight loss and improve overall health",
    "Incorporate high-intensity interval training (HIIT) into your workout routine",
    "Eat slowly and mindfully to help with portion control and digestion",
    "Choose lean protein sources such as chicken, fish, and tofu",
    "Include healthy fats in your diet, such as avocados and olive oil",
    "Cut back on added sugars and sugary drinks",
    "Eat more fruits and vegetables to boost nutrition and fiber intake",
    "Find a form of physical activity you enjoy and make it a part of your routine",
    "Keep track of your food intake with a food diary or nutrition tracking app",
    "Get enough sleep: Lack of sleep can lead to weight gain, as it can increase hunger and cravings for unhealthy foods. Aim for 7-9 hours of sleep per night.",
    "Eat slowly and mindfully: Take your time while eating and pay attention to your food. This can help you feel more satisfied and prevent overeating.",
    "Drink plenty of water: Staying hydrated can help you feel full and keep your metabolism running smoothly. Aim for at least 8 cups of water per day.",
    "Include protein in every meal: Protein can help you feel full and satisfied, making it easier to stick to your weight loss goals. Good sources of protein include lean meats, beans, and nuts.",
    "Eat plenty of fruits and vegetables: These nutrient-rich foods are low in calories and can help you feel full. Aim for at least 5 servings per day.",
    "Limit added sugars: Sugary foods and drinks can contribute to weight gain and should be limited as much as possible. Instead, opt for naturally sweet foods like fruit and honey.",
    "Exercise regularly: Regular physical activity can help you burn calories and maintain a healthy weight. Aim for at least 150 minutes of moderate intensity exercise per week.",
    "Eat healthy fats: Healthy fats like olive oil, avocado, and nuts can help keep you feeling full and satisfied, and may even help with weight loss. Just be sure to keep your portions in check.",
    "Keep track of your progress: Using a food diary or tracking app can help you stay on track with your weight loss goals. Regularly checking in can help you stay motivated and make any necessary adjustments.",
    "Don't skip meals: Skipping meals can lead to overeating later in the day, making it harder to stick to your weight loss goals. Aim to eat regular, balanced meals throughout the day.",
    "Track your food intake using a food diary or app. This will help you understand your eating habits and make necessary changes.",
    "Plan your meals in advance. This will help you make healthier choices and avoid impulse eating.",
    "Choose foods that are high in fiber and protein. These nutrients will help keep you feeling fuller for longer and help you reach your weight loss goals.",
    "Don't skip meals. Skipping meals can cause you to overeat later in the day and make it harder to reach your weight loss goals.",
    "Get enough sleep. Lack of sleep can lead to weight gain and make it harder to lose weight.",
    "Drink plenty of water. Water can help fill you up and flush out toxins.",
    "Find a form of physical activity that you enjoy. This will make it easier to stick to an exercise routine.",
    "Don't compare yourself to others. Focus on your own progress and goals.",
    "Find a support system. Having a support system can help you stay motivated and on track.",
    "Be patient. Weight loss takes time and consistency. Don't get discouraged if you don't see immediate results.",
    "Drink plenty of water throughout the day",
    "Make sure to get at least 7-9 hours of sleep each night",
    "Try to incorporate more vegetables into your meals",
    "Choose whole grains over refined grains",
    "Get moving! Incorporate physical activity into your daily routine",
    "Use smaller plates to portion your meals",
    "Eat slowly and mindfully",
    "Cut back on added sugars and sodium",
    "Don't skip meals, aim to eat every 3-4 hours",
    "Find a supportive friend or family member to help you on your weight loss journey"
  ]
}