{
  "plan_id": "1",
  "days": [
    {
      "day": "Monday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Scrambled eggs with spinach and whole grain toast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Grilled chicken salad with mixed greens and vinaigrette dressing",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Baked salmon with roasted vegetables",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Tuesday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Oatmeal with berries and nuts",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Turkey and avocado wrap with mixed greens",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Quinoa and black bean stir fry with vegetables",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of cardio",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"   
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Wednesday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Greek yogurt with berries and nuts",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Tuna salad with mixed greens and whole grain crackers",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Grilled vegetables with quinoa",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Thursday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Egg white omelette with spinach and whole grain toast",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Grilled chicken and vegetable skewers with quinoa",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Roasted salmon with sweet potato and broccoli",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of cardio",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Friday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Oatmeal with nuts and dried fruit",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Turkey and avocado wrap with mixed greens",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Grilled tofu with roasted vegetables and quinoa",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of strength training",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Saturday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Scrambled eggs with whole grain toast and fruit",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Chicken and quinoa salad with mixed greens",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Stir fry with vegetables and tofu",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of yoga",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    },
    {
      "day": "Sunday",
      "meals": [
        {
          "name": "Breakfast",
          "description": "Smoothie bowl with berries and nuts",
          "start_time": "07:00",
          "end_time": "07:30"
        },
        {
          "name": "Lunch",
          "description": "Taco salad with ground turkey and avocado",
          "start_time": "12:00",
          "end_time": "12:30"
        },
        {
          "name": "Dinner",
          "description": "Grilled chicken with roasted vegetables and brown rice",
          "start_time": "18:00",
          "end_time": "18:30"
        }
      ],
      "activity": [
        {
          "name": "Warm up with 5 minute jog",
          "duration": 5,
          "start_time": "09:00",
          "end_time": "09:05"
        },
        {
          "name": "30 minutes of cardio",
          "duration": 30,
          "start_time": "09:30",
          "end_time": "10:00"
        }
      ],
      "sleep": [
        {
          "start_time": "22:00",
          "end_time": "07:00"
        }
      ]
    }
  ],
  "advice": [
    "Start each meal with a small serving of vegetables to fill up on low-calorie, nutrient-dense foods.",
    "Choose protein sources that are lean and low in saturated fat, such as chicken, fish, and beans.",
    "Incorporate strength training into your fitness routine to build lean muscle and boost your metabolism.",
    "Drink plenty of water throughout the day to stay hydrated and prevent overeating.",
    "Get enough sleep each night to support healthy weight loss and overall well-being.",
    "Choose whole grains over refined grains for added nutrients and fiber.",
    "Limit your intake of sugary drinks and snacks to reduce your overall calorie intake.",
    "Plan your meals and snacks in advance to stay on track and avoid impulsive eating.",
    "Choose healthier cooking methods, such as grilling, baking, or roasting, instead of deep frying.",
    "Get support from friends, family, or a healthcare professional to help you stay motivated and on track.",
    "Stay hydrated by drinking at least 8 glasses of water per day",
    "Get plenty of sleep to aid in weight loss and improve overall health",
    "Incorporate high-intensity interval training (HIIT) into your workout routine",
    "Eat slowly and mindfully to help with portion control and digestion",
    "Choose lean protein sources such as chicken, fish, and tofu",
    "Include healthy fats in your diet, such as avocados and olive oil",
    "Cut back on added sugars and sugary drinks",
    "Eat more fruits and vegetables to boost nutrition and fiber intake",
    "Find a form of physical activity you enjoy and make it a part of your routine",
    "Keep track of your food intake with a food diary or nutrition tracking app",
    "Get enough sleep: Lack of sleep can lead to weight gain, as it can increase hunger and cravings for unhealthy foods. Aim for 7-9 hours of sleep per night.",
    "Eat slowly and mindfully: Take your time while eating and pay attention to your food. This can help you feel more satisfied and prevent overeating.",
    "Drink plenty of water: Staying hydrated can help you feel full and keep your metabolism running smoothly. Aim for at least 8 cups of water per day.",
    "Include protein in every meal: Protein can help you feel full and satisfied, making it easier to stick to your weight loss goals. Good sources of protein include lean meats, beans, and nuts.",
    "Eat plenty of fruits and vegetables: These nutrient-rich foods are low in calories and can help you feel full. Aim for at least 5 servings per day.",
    "Limit added sugars: Sugary foods and drinks can contribute to weight gain and should be limited as much as possible. Instead, opt for naturally sweet foods like fruit and honey.",
    "Exercise regularly: Regular physical activity can help you burn calories and maintain a healthy weight. Aim for at least 150 minutes of moderate intensity exercise per week.",
    "Eat healthy fats: Healthy fats like olive oil, avocado, and nuts can help keep you feeling full and satisfied, and may even help with weight loss. Just be sure to keep your portions in check.",
    "Keep track of your progress: Using a food diary or tracking app can help you stay on track with your weight loss goals. Regularly checking in can help you stay motivated and make any necessary adjustments.",
    "Don't skip meals: Skipping meals can lead to overeating later in the day, making it harder to stick to your weight loss goals. Aim to eat regular, balanced meals throughout the day.",    
    "Track your food intake using a food diary or app. This will help you understand your eating habits and make necessary changes.",
    "Plan your meals in advance. This will help you make healthier choices and avoid impulse eating.",
    "Choose foods that are high in fiber and protein. These nutrients will help keep you feeling fuller for longer and help you reach your weight loss goals.",
    "Don't skip meals. Skipping meals can cause you to overeat later in the day and make it harder to reach your weight loss goals.",
    "Get enough sleep. Lack of sleep can lead to weight gain and make it harder to lose weight.",
    "Drink plenty of water. Water can help fill you up and flush out toxins.",
    "Find a form of physical activity that you enjoy. This will make it easier to stick to an exercise routine.",
    "Don't compare yourself to others. Focus on your own progress and goals.",
    "Find a support system. Having a support system can help you stay motivated and on track.",
    "Be patient. Weight loss takes time and consistency. Don't get discouraged if you don't see immediate results.",
    "Drink plenty of water throughout the day",
    "Make sure to get at least 7-9 hours of sleep each night",
    "Try to incorporate more vegetables into your meals",
    "Choose whole grains over refined grains",
    "Get moving! Incorporate physical activity into your daily routine",
    "Use smaller plates to portion your meals",
    "Eat slowly and mindfully",
    "Cut back on added sugars and sodium",
    "Don't skip meals, aim to eat every 3-4 hours",
    "Find a supportive friend or family member to help you on your weight loss journey"
    ]
}